[
  {
    "id": "9788575227268",
    "isbn": "978-8544001516",
    "titulo": "O Conde de Monte-Cristo",
    "slug": "o-conde-de-monte-cristo",
    "autor": "Alexandre Dumas",
    "categoria": "classico",
    "ano": "2017",
    "paginas": "1304",
    "preco": "117,00",
    "descricao": "Um dos maiores clássicos da literatura francesa há mais de 150 anos, “O conde de Monte-Cristo” gira em torno de Edmond Dantè, que é preso por um crime que não cometeu. Ao sair da prisão, Edmond vai à busca de vingança contra seus inimigos. Uma trama repleta de reviravoltas dignas de um jogo de xadrez. A edição possui capa dura com jaqueta dupla face, para o leitor escolher e alternar entre as duas versões da capa."
  },
  {
    "id": "9788575227145",
    "isbn": "978-8537817988",
    "titulo": "O Quebra-Nozes: edição bolso de luxo",
    "slug": "o-quebra-nozes",
    "autor": "Alexandre Dumas",
    "categoria": "classico",
    "ano": "2018",
    "paginas": "344",
    "preco": "29,97",
    "descricao": "É véspera de Natal. Marie se encanta, dentre todos os presentes, por um quebra-nozes em formato de boneco. Ela acomoda o novo amigo no armário de brinquedos – mas, à meia-noite, ouve estranhos ruídos. Aterrorizada, vê seu padrinho, o inventor Drosselmeier, sinistramente acocorado sobre o relógio de parede, e um exército de camundongos invadindo a sala, comandado por um rei de sete cabeças! Contra eles, os brinquedos saem do armário e põem-se em formação. Têm uma grande batalha pela frente, sob as ordens do Quebra-Nozes... Entre o sonho e a realidade, Marie viverá histórias maravilhosas e estranhas, de reinos, feitiços e delícias. Histórias em que o inusitado padrinho tem um papel especial, e nas quais só pode embarcar quem tem os olhos e o coração preparados. Você tem? Esta edição inclui as duas variantes da história: a versão original de E.T.A. Hoffmann e a clássica de Alexandre Dumas – que popularizou a história e inspirou o famoso balé de Tchaikovsky –, com tradução de André Telles (do francês) e Luís S. Krausz (do alemão). Traz ainda apresentação da pesquisadora e especialista em contos de fadas Priscila Mana Vaz e mais de 200 ilustrações de época. A versão impressa apresenta capa dura e o acabamento de luxo característico da coleção Clássicos Zahar."
  },
  {
    "id": "9788575226919",
    "isbn": "978-6555520002",
    "titulo": "Drácula",
    "slug": "dracula",
    "autor": "Drácula",
    "categoria": "classico",
    "ano": "2020",
    "paginas": "368",
    "preco": "12,38",
    "descricao": "Drácula é um clássico da literatura de terror e apresenta por meio de cartas, diários e notícias os ataques do vampiro Conde Drácula a moradores de Londres e da Transilvânia. O romance epistolar marcou o gênero e, mesmo não sendo a primeira obra a retratar esse mito literário, definiu o que conhecemos hoje como vampiro, influenciando a literatura, cinema e teatro."
  },
  {
    "id": "9788575225509",
    "isbn": "978-85-7522-550-9",
    "titulo": "Admirável mundo novo",
    "slug": "admiravel-mundo-novo",
    "autor": "Aldous Huxley",
    "categoria": "classico",
    "ano": "2014",
    "paginas": "312",
    "preco": "28,79",
    "descricao": "Em uma sociedade organizada segundo princípios estritamente científicos, Bernard Marx, um psicólogo, sente-se inadequado quando se compara aos outros seres de sua casta. Ao descobrir uma “reserva histórica” que preserva costumes de uma sociedade anterior – muito semelhante à do leitor – Bernard vai perceber as diferenças entre esta civilização e a sua – e a partir de um sentimento de inconformismo ele desafiará o mundo. A história de Bernard se passa em um ambiente em que a literatura, a música e o cinema só têm a função de solidificar a alienação; um universo que louva o avanço da técnica, a produção em série, a uniformidade contra a diversidade. Muitas das previsões de Huxley vieram a ser confirmadas anos mais tarde, como a tecnologia reprodutiva, as supostas técnicas de aprendizado durante o sono e a manipulação pelo condicionamento psicológico. Ao lado de obras como Fahrenheit 451, de Ray Bradbury, e 1984, de George Orwell, que criticavam os governos totalitários de esquerda e de direita, Admirável Mundo Novo figura na lista dos livros mais relevantes e influentes de todos os tempos. O clássico de Huxley não é somente um hábil exercício de futurismo ou de ficção científica, mas um olhar acerca do autoritarismo no mundo desde que o livro foi publicado, em 1932, e que continua a nos assombrar."
  },
  {
    "id": "9788575228142",
    "isbn": "978-8525052247",
    "titulo": "Fahrenheit 451",
    "slug": "fahrenheit-451",
    "autor": "Ray Bradbury",
    "categoria": "classico",
    "ano": "2012",
    "paginas": "216",
    "preco": "31,88",
    "descricao": "Guy Montag é um bombeiro. Sua profissão é atear fogo nos livros. Em um mundo onde as pessoas vivem em função das telas e a literatura está ameaçada de extinção, os livros são objetos proibidos, e seus portadores são considerados criminosos. Montag nunca questionou seu trabalho; vive uma vida comum, cumpre o expediente e retorna ao final do dia para sua esposa e para a rotina do lar. Até que conhece Clarisse, uma jovem de comportamento suspeito, cheia de imaginação e boas histórias. Quando sua esposa entra em colapso mental e Clarisse desaparece, a vida de Montag não poderá mais ser a mesma. Um clássico da ficção científica e da literatura distópica, Fahrenheit 451 foi escrito originalmente como um conto: 'O bombeiro', contido no volume Prazer em Queimar: histórias de Fahrenheit 451. Incentivado pelo seu editor, transformou a ideia inicial em um romance, que se tornou um dos livros mais influentes de sua geração – e também um dos mais censurados e banidos de todos os tempos. Foi adaptado para o cinema duas vezes, a primeira pelas mãos do lendário cineasta francês François Truffaut, e depois para diversos formatos. Escrito durante a era do macartismo – a sistemática censura à arte promovida pelo governo americano nos anos 1950 – Bradbury costumava dizer que a proibição a livros não foi o motivo central que o levou a compor a obra, e sim a percepção de que as pessoas passavam a se interessar cada vez menos pela literatura com o surgimento de novas mídias, como a televisão. Com o passar do tempo, Fahrenheit 451 ganhou muitas camadas de interpretação: a história de um burocrata que questiona a vileza do seu trabalho, o poder libertador da palavra, a estupidez da censura às artes. Embora soubesse estar testemunhando uma transformação social única, Bradbury afirmava não acreditar que o cenário que imaginou se tornaria realidade tão rápido. Lançado em 1953, Fahrenheit 451 é hoje uma obra de leitura indispensável junto com 1984, de George Orwell, e Admirável Mundo Novo, de Aldous Huxley."
  },
  {
    "id": "9788575228098",
    "isbn": "978-85-7522-809-8",
    "titulo": "A revolução dos bichos",
    "slug": "a-revolucao-dos-bichos",
    "autor": "George Orwell",
    "categoria": "classico",
    "ano": "2007",
    "paginas": "152",
    "preco": "10,90",
    "descricao": "Verdadeiro clássico moderno, concebido por um dos mais influentes escritores do século XX, A revolução dos bichos é uma fábula sobre o poder. Narra a insurreição dos animais de uma granja contra seus donos. Progressivamente, porém, a revolução degenera numa tirania ainda mais opressiva que a dos humanos. Escrita em plena Segunda Guerra Mundial e publicada em 1945 depois de ter sido rejeitada por várias editoras, essa pequena narrativa causou desconforto ao satirizar ferozmente a ditadura stalinista numa época em que os soviéticos ainda eram aliados do Ocidente na luta contra o eixo nazifascista. De fato, são claras as referências: o despótico Napoleão seria Stálin, o banido Bola-de-Neve seria Trotsky, e os eventos políticos - expurgos, instituição de um estado policial, deturpação tendenciosa da História - mimetizam os que estavam em curso na União Soviética. Com o acirramento da Guerra Fria, as mesmas razões que causaram constrangimento na época de sua publicação levaram A revolução dos bichos a ser amplamente usada pelo Ocidente nas décadas seguintes como arma ideológica contra o comunismo. O próprio Orwell, adepto do socialismo e inimigo de qualquer forma de manipulação política, sentiu-se incomodado com a utilização de sua fábula como panfleto. Depois das profundas transformações políticas que mudaram a fisionomia do planeta nas últimas décadas, a pequena obra-prima de Orwell pode ser vista sem o viés ideológico reducionista. Mais de sessenta anos depois de escrita, ela mantém o viço e o brilho de uma alegoria perene sobre as fraquezas humanas que levam à corrosão dos grandes projetos de revolução política. É irônico que o escritor, para fazer esse retrato cruel da humanidade, tenha recorrido aos animais como personagens. De certo modo, a inteligência política que humaniza seus bichos é a mesma que animaliza os homens. Escrito com perfeito domínio da narrativa, atenção às minúcias e extraordinária capacidade de criação de personagens e situações, A revolução dos bichos combina de maneira feliz duas ricas tradições literárias: a das fábulas morais, que remontam a Esopo, e a da sátira política, que teve talvez em Jonathan Swift seu representante máximo. 'A melhor sátira já escrita sobre a face negra da história moderna.' Malcolm Bradbury 'Um livro para todos os tipos de leitor, seu brilho ainda intacto depois de sessenta anos.' Ruth Rendell"
  },
  {
    "id": "9788575228050",
    "isbn": "978-8537815533",
    "titulo": "Persuasão: edição bolso de luxo",
    "slug": "persuasao-edicao-de-bolso",
    "autor": "Jane Austen",
    "categoria": "classico",
    "ano": "2016",
    "paginas": "368",
    "preco": "29,84",
    "descricao": "Anne Elliot, filha de um vaidoso e esnobe baronete, apaixona-se por Frederick Wentworth, um jovem ambicioso e inteligente, mas sem conexões familiares importantes. Obedecendo à recomendação da sua família, Anne sacrifica então seu grande amor por conveniências sociais, e, ao fazê-lo, fecha-se para novos relacionamentos, recusando inclusive uma proposta de casamento. Oito anos depois, Frederick, agora mais velho e rico, ressurge, abalando a ordem estabelecida e a paz familiar. Ambientado na Inglaterra rural do século XIX, Persuasão, último romance de Jane Austen, é uma obra-prima na qual a escritora revela estar em plena maturidade criativa. Em cuidadosa tradução, esta edição traz a versão definitiva do romance, conforme revisto pela autora, e uma breve apresentação. A edição impressa apresenta capa dura e acabamento de luxo."
  },
  {
    "id": "9788575227800",
    "isbn": "978-8582850572",
    "titulo": "Mrs. Dalloway",
    "slug": "mrs-dalloway",
    "autor": "Virginia Woolf",
    "categoria": "classico",
    "ano": "2017",
    "paginas": "328",
    "preco": "20,89",
    "descricao": "Obra mais famosa de Virginia Woolf, Mrs. Dalloway narra um único dia da vida da famosa protagonista Clarissa Dalloway, que percorre as ruas de Londres dos anos 1920 cuidando dos preparativos para a festa que realizará no mesmo dia à noite. Pioneiro na exploração do inconsciente humano por meio do fluxo de consciência, Mrs. Dalloway se consagrou tanto pelo experimentalismo linguístico quanto pelo retrato preciso das transformações da Inglaterra do períodoentre guerras. Misto de romance psicológico com ensaio filosófico, este livro resiste a classificações simplistas e inaugura um gênero por si só. Precursor de algumas das maiores obras literárias do século XX, este romance é uma leitura incontornável que todo mundo deve fazer ao menos uma vez na vida."
  },
  {
    "id": "9788575226773",
    "isbn": "978-8563560438",
    "titulo": "O retrato de Dorian Gray",
    "slug": "o-retrato-de-dorian-gray",
    "autor": "Oscar Wilde",
    "categoria": "classico",
    "ano": "2012",
    "paginas": "264",
    "preco": "21,98",
    "descricao": "Em 1891, quando foi publicado em sua versão final, O retrato de Dorian Gray foi recebido com escândalo, e provocou um intenso debate sobre o papel da arte em relação à moralidade. Alguns anos mais tarde, o livro foi inclusive usado contra o próprio autor em processos judiciais, como evidência de que ele possuía “uma certa tendência” - no caso, a homossexualidade, motivo pelo qual acabou condenado a dois anos de prisão por atentado ao pudor. Mais de cem anos depois, porém, o único romance de Oscar Wilde continua sendo lido e debatido no mundo inteiro, e por questões que vão muito além do moralismo do fim do período vitoriano na Inglaterra, definida por um dos personagens do livro como “a terra natal da hipocrisia”. Seu tema central - um personagem que leva uma vida dupla, mantendo uma aparência de virtude enquanto se entrega ao hedonismo mais extremado - tem apelo atemporal e universal, e sua trama se vale de alguns dos traços que notabilizaram a melhor literatura de sua época, como a presença de elementos fantásticos e de grandes reflexões filosóficas, além do senso de humor sagaz e do sarcasmo implacável característicos de Wilde."
  },
  {
    "id": "9788575228074",
    "isbn": "978-85-7522-807-4",
    "titulo": "O médico e o monstro",
    "slug": "o-medico-e-o-monstro",
    "autor": "Robert Louis Stevenson",
    "categoria": "classico",
    "ano": "2019",
    "paginas": "96",
    "preco": "8,99",
    "descricao": "Gabriel John Utterson é um advogado que investiga um caso estranho envolvendo Henry Jekyll e Edward Hyde, repentino beneficiário do testamento de Henry. O advogado descobre acontecimentos que resultam na reclusão repentina de Jekyll. O romance que envolve ficção científica, transtornos psicológicos e terror é um grande clássico do gênero."
  },
  {
    "id": "9788575226322",
    "isbn": "978-8575227183",
    "titulo": "Introdução à Programação com Python: Algoritmos e Lógica de Programação Para Iniciantes",
    "slug": "introducao-a-programacao-com-python",
    "autor": "Nilo Ney Coutinho Menezes",
    "categoria": "programacao",
    "ano": "2019",
    "paginas": "328",
    "preco": "43,00",
    "descricao": "Este livro é orientado ao iniciante em programação. Os conceitos básicos de programação, como expressões, variáveis, repetições, decisões, listas, dicionários, conjuntos, funções, arquivos, classes, objetos e banco de dados com SQLite 3 são apresentados um a um com exemplos e exercícios. A obra visa a explorar a programação de computadores como ferramenta do dia a dia. Ela pode ser lida durante um curso de introdução à programação de computadores e usada como guia de estudo para autodidatas. Para aproveitamento pleno do conteúdo, apenas conhecimentos básicos de informática, como digitar textos, abrir e salvar arquivos, são suficientes. Todo software utilizado no livro pode ser baixado gratuitamente, sendo executado em Windows, Linux e Mac OS X. Embora a linguagem Python (versão +3.7) seja muito poderosa e repleta de recursos modernos de programação, este livro não pretende ensinar a linguagem em si, mas ensinar a programar. Alguns recursos da linguagem não foram utilizados para privilegiar os exercícios de lógica de programação e oferecer uma preparação mais ampla ao leitor para outras linguagens. Essa escolha não impediu a apresentação de recursos poderosos da linguagem, e, embora o livro não seja fundamentalmente uma obra de referência, o leitor encontrará várias notas e explicações de características específicas do Python, além da lógica de programação."
  },
  {
    "id": "9788575224038",
    "isbn": "978-8575225639",
    "titulo": "Entendendo Algoritmos: Um Guia Ilustrado Para Programadores e Outros Curiosos",
    "slug": "entendendo-algoritomos",
    "autor": "Aditya Bhargava",
    "categoria": "programacao",
    "ano": "2017",
    "paginas": "265",
    "preco": "44,00",
    "descricao": "Um guia ilustrado para programadores e outros curiosos. Um algoritmo nada mais é do que um procedimento passo a passo para a resolução de um problema. Os algoritmos que você mais utilizará como um programador já foram descobertos, testados e provados. Se você quer entendê-los, mas se recusa a estudar páginas e mais páginas de provas, este é o livro certo. Este guia cativante e completamente ilustrado torna simples aprender como utilizar os principais algoritmos nos seus programas. O livro Entendendo Algoritmos apresenta uma abordagem agradável para esse tópico essencial da ciência da computação. Nele, você aprenderá como aplicar algoritmos comuns nos problemas de programação enfrentados diariamente. Você começará com tarefas básicas como a ordenação e a pesquisa. Com a prática, você enfrentará problemas mais complexos, como a compressão de dados e a inteligência artificial. Cada exemplo é apresentado em detalhes e inclui diagramas e códigos completos em Python; Ao final deste livro, você terá dominado algoritmos amplamente aplicáveis e saberá quando e onde utilizá-los. O que este livro inclui: a abordagem de algoritmos de pesquisa, ordenação e algoritmos gráficos; mais de 400 imagens com descrições detalhadas; comparações de desempenho entre algoritmos; exemplos de código em Python."
  },
  {
    "id": "9788575223925",
    "isbn": "978-8576082675",
    "titulo": "Código limpo: Habilidades práticas do Agile Software",
    "slug": "codigo-limpo",
    "autor": "Robert C. Martin",
    "categoria": "programacao",
    "ano": "2009",
    "paginas": "425",
    "preco": "71,87",
    "descricao": "Mesmo um código ruim pode funcionar. Mas se ele não for limpo, pode acabar com uma empresa de desenvolvimento. Perdem-se a cada ano horas incontáveis e recursos importantes devido a um código mal escrito. Mas não precisa ser assim.O renomado especialista em software, Robert C. Martin, apresenta um paradigma revolucionário com Código limpo: Habilidades Práticas do Agile Software. Martin se reuniu com seus colegas do Mentor Object para destilar suas melhores e mais ágeis práticas de limpar códigos “dinamicamente” em um livro que introduzirá gradualmente dentro de você os valores da habilidade de um profissional de softwares e lhe tornar um programador melhor –mas só se você praticar.Que tipo de trabalho você fará? Você lerá códigos aqui, muitos códigos. E você deverá descobrir o que está correto e errado nos códigos. E, o mais importante, você terá de reavaliar seus valores profissionais e seu comprometimento com o seu ofício.Código limpo está divido em três partes. Na primeira há diversos capítulos que descrevem os princípios, padrões e práticas para criar um código limpo.A segunda parte consiste em diversos casos de estudo de complexidade cada vez maior. Cada um é um exercício para limpar um código – transformar o código base que possui alguns problemas em um melhor e eficiente. A terceira parte é a compensação: um único capítulo com uma lista de heurísticas e “odores” reunidos durante a criação dos estudos de caso. O resultado será um conhecimento base que descreve a forma como pensamos quando criamos, lemos e limpamos um código.Após ler este livro os leitores saberão:✔ Como distinguir um código bom de um ruim✔ Como escrever códigos bons e como transformar um ruim em um bom✔ Como criar bons nomes, boas funções, bons objetos e boas classes✔ Como formatar o código para ter uma legibilidade máxima✔ Como implementar completamente o tratamento de erro sem obscurecer a lógica✔ Como aplicar testes de unidade e praticar o desenvolvimento dirigido a testesEste livro é essencial para qualquer desenvolvedor, engenheiro de software, gerente de projeto, líder de equipes ou analistas de sistemas com interesse em construir códigos melhores."
  },
  {
    "id": "9788575222898",
    "isbn": "978-8550804606",
    "titulo": "Arquitetura limpa: O guia do artesão para estrutura e matematica de software",
    "slug": "arquitetura-limpa",
    "autor": "Robert C. Martin",
    "categoria": "programacao",
    "ano": "2019",
    "paginas": "432",
    "preco": "69,34",
    "descricao": "As regras universais de arquitetura de software aumentam dramaticamente a produtividade dos desenvolvedores ao longo da vida dos sistemas de software. Agora, aproveitando o sucesso dos seus best-sellers 'Código Limpo' e 'O Codificador Limpo', o lendário artesão de software Robert C. Martin (“Uncle Bob”) vai revelar essas regras e ajudar o leitor a aplicá-las.A 'Arquitetura Limpa' de Martin não é só mais um catálogo de opções. Com base em meio século de experiência nos mais variados ambientes de software, Martin indica as escolhas que você deve fazer e explica por que elas são cruciais para o seu sucesso. Como já era esperado do Uncle Bob, este livro está cheio de soluções simples e diretas para os desafios reais que você enfrentará - aqueles que irão influenciar diretamente o sucesso ou fracasso dos seus projetos. Aprenda sobre as metas dos arquitetos de software - e as principais disciplinas e práticas que podem concretizá-las;Domine os princípios essenciais do matematica de software para abordar função, separação de componentes e gestão de dados;Veja como os paradigmas de programação impõem disciplina ao restringirem as ações dos desenvolvedores;Saiba identificar o que é crucialmente importante e o que é apenas um “detalhe”;Implemente estruturas ótimas e de alto nível para web, banco de dados, thick-client, console e aplicativos incorporados;Defina limites e camadas adequadas e organize os componentes e serviços;Saiba por que designs e arquiteturas dão errado e como prevenir (ou corrigir) essas falhas."
  },
  {
    "id": "9788575221662",
    "isbn": "978-85-7522-166-2",
    "titulo": "O codificador limpo: Um código de conduta para programadores profissionais",
    "slug": "o-codificador-limpo",
    "autor": "Robert C. Martin",
    "categoria": "programacao",
    "ano": "2012",
    "paginas": "244",
    "preco": "49,80",
    "descricao": "Então você quer ser um profissional do desenvolvimento de softwares. Quer erguer a cabeça e declarar para o mundo: “Eu sou um profissional!”. Quer que as pessoas olhem para você com respeito e o tratem com consideração. Você quer isso tudo. Certo? O termo “Profissionalismo” é, sem dúvida, um distintivo de honra e orgulho, mas também é um marcador de incumbência e responsabilidade, que inclui trabalhar bem e honestamente. Verdadeiros profissionais praticam e trabalham firme para manter suas habilidades afiadas e prontas. Não é o bastante simplesmente fazer suas tarefas diárias e chamar isso de prática. Realizar seu trabalho diário é performance, e não prática. Prática é quando você especificamente exercita as habilidades fora do seu ambiente de trabalho com o único propósito de potencializá-las. O Codificador Limpo contém muitos conselhos pragmáticos que visam transformar o comportamento do profissional de software. O autor transmite valiosos ensinamentos sobre ética, respeito, responsabilidade, sinceridade e comprometimento, através de sua experiência como programador."
  },
  {
    "id": "9788575221396",
    "isbn": "978-8575224151",
    "titulo": "Estruturas de Dados e Algoritmos com JavaScript: Escreva um Código JavaScript Complexo e Eficaz Usando a Mais Recente ECMAScript",
    "slug": "estruturas-de-dados-e-algoritmos-com-javascript",
    "autor": "Loiane Groner",
    "categoria": "programacao",
    "ano": "2019",
    "paginas": "408",
    "preco": "60,00",
    "descricao": "Uma estrutura de dados é uma maneira particular de organizar dados em um computador com o intuito de usar os recursos de modo eficaz. As estruturas de dados e os algoritmos são a base de todas as soluções para qualquer problema de programação. Com este livro, você aprenderá a escrever códigos complexos e eficazes usando os recursos mais recentes da ES 2017. O livro 'Estruturas de dados e algoritmos com JavaScript' começa abordando o básico sobre JavaScript e apresenta a ECMAScript 2017, antes de passar gradualmente para as estruturas de dados mais importantes, como arrays, filas, pilhas e listas ligadas. Você adquirirá um conhecimento profundo sobre como as tabelas hash e as estruturas de dados para conjuntos funcionam, assim como de que modo as árvores e os mapas hash podem ser usados para buscar arquivos em um disco rígido ou para representar um banco de dados. Este livro serve como um caminho para você mergulhar mais fundo no JavaScript. Você também terá uma melhor compreensão de como e por que os grafos – uma das estruturas de dados mais complexas que há – são amplamente usados em sistemas de navegação por GPS e em redes sociais."
  },
  {
    "id": "9788575227305",
    "isbn": "978-8594318787",
    "titulo": "A metamorfose",
    "slug": "a-metamorfose",
    "autor": "Franz Kafka",
    "categoria": "classico",
    "ano": "2019",
    "paginas": "96",
    "preco": "10,80",
    "descricao": "O caixeiro-viajante Gregor acorda metamorfoseado em um enorme inseto e percebe que tudo mudou e não só em sua vida, mas no mundo. Ele, então, acompanha as reações de sua família ao perceberem o estranho ser em que ele se tornou. E, enquanto luta para se manter vivo, reflete sobre o comportamento de seus pais, de sua irmã e sobre a sua nova vida."
  },
  {
    "id": "9788575226834",
    "isbn": "978-8576573135",
    "titulo": "Duna: livro 1",
    "slug": "duna-livro-1",
    "autor": "Frank Herbert",
    "categoria": "classico",
    "ano": "2017",
    "paginas": "680",
    "preco": "77,40",
    "descricao": "Uma estonteante mistura de aventura e misticismo, ecologia e política, este romance ganhador dos prêmios Hugo e Nebula deu início a uma das mais épicas histórias de toda a ficção científica. Duna é um triunfo da imaginação, que influenciará a literatura para sempre.Esta edição inédita, com introdução de Neil Gaiman, apresenta ao leitor o universo fantástico criado por Herbert e que será adaptado ao cinema por Denis Villeneuve, diretor de A chegada e de Blade Runner 2049."
  },
  {
    "id": "9788575224441",
    "isbn": "978-8578270698",
    "titulo": "As crônicas de Nárnia",
    "slug": "as-cronicas-de-narnia",
    "autor": "C. S. Lewis",
    "categoria": "classico",
    "ano": "2009",
    "paginas": "752",
    "preco": "46,90",
    "descricao": "Viagens ao fim do mundo, criaturas fantásticas e batalhas épicas entre o bem e o mal - o que mais um leitor poderia querer de um livro? O livro que tem tudo isso é 'O leão, a feiticeira e o guarda-roupa', escrito em 1949 por Clive Staples Lewis. MasLewis não parou por aí. Seis outros livros vieram depois e, juntos, ficaram conhecidos como 'As crônicas de Nárnia'. Nos últimos cinqüenta anos, 'As crônicas de Nárnia' transcenderam o gênero da fantasia para se tornar parte do cânone da literaturaclássica. Cada um dos sete livros é uma obra-prima, atraindo o leitor para um mundo em que a magia encontra a realidade, e o resultado é um mundo ficcional que tem fascinado gerações. Esta edição apresenta todas as sete crônicas integralmente, num único volume. Os livros são apresentados de acordo com a ordem de preferência de Lewis, cada capítulo com uma ilustração do artista original, Pauline Baynes. Enganosamente simples e direta, 'As crônicas de Nárnia' continuam cativando os leitores com aventuras, personagens e fatos que falam a pessoas de todas as idades."
  },
  {
    "id": "9788575223666",
    "isbn": "978-8535720068",
    "titulo": "Matemática - Volume único",
    "slug": "matematica-volume-unico",
    "autor": "Gelson Iezzi - Osvaldo Dolce - David Degenszain - Roberto Périgo",
    "categoria": "matematica",
    "ano": "2019",
    "paginas": "960",
    "preco": "115,99",
    "descricao": "Conheça a mais nova edição da obra que é um curso completo de Matemática para o ensino médio em um único volume. Nesta edição, moderna e atualizada, aluno e professor encontram: - Conceitos precisos apresentados em linguagem simples e de fácil leitura, exemplificados por exercícios resolvidos; - Textos, gráficos e tabelas retirados de jornais e revistas de grande circulação que facilitam a contextualização dos temas estudados; - Testes recentes de vestibulares e do Enem que auxiliam o preparo do aluno para o ingresso nas melhores faculdades; - Desafios que estimulam o desenvolvimento do raciocínio e da criatividade em sua resolução. E, para ampliar os conceitos apresentados, oferecemos textos que mostram a ligação de temas matemáticos a outras áreas do conhecimento como Economia, Química, Física e Filosofia. Com essas atualizações, o aprendizado de Matemática certamente se tornará mais prazeroso e interessante."
  },
  {
    "id": "9788575225127",
    "isbn": "978-6555065428",
    "titulo": "Análise real",
    "slug": "ansalise-real",
    "autor": "Maurício Zahn",
    "categoria": "matematica",
    "ano": "2022",
    "paginas": "456",
    "preco": "125,20",
    "descricao": "A Análise real é uma das disciplinas mais importantes de um curso de graduação em matemática. É nela em que são provados, com o devido rigor, resultados do cálculo diferencial e integral, além de muitos outros resultados teóricos que transcendem um curso tradicional de cálculo, e nos quais um estudante de matemática deve aprender, dando a ele uma visão mais ampla e fornecendo, também, embasamento para seguir seus estudos em uma pós-graduação na área. Neste livro, o autor procurou apresentar a teoria por inteiro, com riqueza de detalhes em suas demonstrações, desde o estudo de conjuntos até o estudo de séries de funções, contemplando assim a um ou dois cursos de Análise na reta nas universidades brasileiras, dependendo se for um bacharelado ou uma licenciatura, respectivamente. Após cada conteúdo trabalhado foi incluída uma lista de exercícios, muitos dos quais sendo de seleção de mestrado em matemática de várias universidades brasileiras. Alguns desses exercícios foram resolvidos em um anexo e estão indicados ao longo da obra com um asterisco. Esperamos que essa obra possa render bons aprendizados a todos àqueles que buscam um livro de Análise real que seja completo tanto em sua teoria, quanto em seus exercícios."
  },
  {
    "id": "9788575224533",
    "isbn": "978-6555584011",
    "titulo": "Cálculo: Volume 1",
    "slug": "calculo",
    "autor": "James Stewart - Daniel Clegg - Saleem Watson",
    "categoria": "matematica",
    "ano": "2021",
    "paginas": "706",
    "preco": "151,00",
    "descricao": "Nesta 9ª edição, assim como em todas as anteriores, os autores mantêm a tradição de escrever um livro que auxilie os estudantes a descobrir o cálculo – tanto por sua utilidade prática, como por sua surpreendente beleza. O intuito é transmitir ao leitor uma ideia da utilidade do cálculo, assim como promover o desenvolvimento de sua habilidade técnica. Ao mesmo tempo, os autores empenharam-se em valorizar a beleza intrínseca do assunto. Não há dúvida de que Newton experimentou uma sensação de triunfo quando fez suas grandes descobertas. O objetivo desta obra é fazer que os estudantes compartilhem um pouco desse entusiasmo."
  },
  {
    "id": "9788575224380",
    "isbn": "978-85-7522-438-0",
    "titulo": "Fundamentos de HTML5 e CSS3",
    "slug": "fundamentos-de-html5-e-css3",
    "autor": "Maurício Samy Silva",
    "categoria": "programacao",
    "ano": "2015",
    "paginas": "304",
    "preco": "69",
    "descricao": "O livro Fundamentos de HTML5 e CSS3 tem o objetivo de fornecer aos iniciantes e estudantes da área de desenvolvimento web conceitos básicos e fundamentos da marcação HTML e estilização CSS, para a criação de sites, interfaces gráficas e aplicações para a web.Maujor aborda as funcionalidades da HTML5 e das CSS3 de forma clara, em linguagem"
  },
  {
    "id": "9788575224106",
    "isbn": "978-6586057904",
    "titulo": "Lógica de Programação e Algoritmos com JavaScript: uma Introdução à Programação de Computadores com Exemplos e Exercícios Para Iniciantes",
    "slug": "logica-de-programacao-e-algoritmos-com-javascript",
    "autor": "Edécio Fernando Iepsen",
    "categoria": "programacao",
    "ano": "2022",
    "paginas": "352",
    "preco": "60,00",
    "descricao": "Os conteúdos abordados em Lógica de Programação e Algoritmos são fundamentais a todos aqueles que desejam ingressar no universo da Programação de Computadores. Esses conteúdos, no geral, impõem algumas dificuldades aos iniciantes. Neste livro, o autor utiliza sua experiência de mais de 15 anos em lecionar a disciplina de Algoritmos em cursos de graduação, para trabalhar o assunto passo a passo. Cada capítulo foi cuidadosamente planejado a fim de evitar a sobrecarga de informações ao leitor, com exemplos e exercícios de fixação para cada assunto. Os exemplos e exercícios são desenvolvidos em JavaScript, linguagem amplamente utilizada no desenvolvimento de páginas para a internet. Rodar os programas JavaScript não exige nenhum software adicional; é preciso apenas abrir a página em seu navegador favorito. Nesta 2ª edição, além da atualização dos códigos e recursos do JavaScript, foram acrescentados três novos capítulos sobre Node.js, Express e React. Com Node.js é demonstrado como construir Algoritmos da forma “tradicional”, com a entrada e saída de dados via prompt de comandos. Com o Express é desenvolvida uma aplicação back-end com persistência em banco de dados – que recebe e envia dados no formato JSON. E, com o React, é criada a aplicação de front-end, que vai interagir com o usuário e acessar o back-end. São desenvolvidas rotinas de cadastro, pesquisa, exibição de dados estatísticos e criação de gráficos. Como o aprendizado de Algoritmos ocorre a partir do estudo das técnicas de programação e da prática de exercícios, este livro pretende ser uma importante fonte de conhecimentos para você ingressar nessa fascinante área da programação de computadores. Os capítulos cobrem os temas abordados na disciplina de Algoritmos: entrada e saída de dados, condições, repetições, vetores, strings, datas, funções com passagem e retorno de parâmetros, depuração de programas – além de tratar assuntos relacionados à construção de páginas Web com JavaScript."
  },
  {
    "id": "9788575223406",
    "isbn": "978-8540701694",
    "titulo": "Álgebra Linear com Aplicações",
    "slug": "algebra-linear-com-aplicacoes",
    "autor": "Howard Anton - Chris Rorres",
    "categoria": "matematica",
    "ano": "2012",
    "paginas": "786",
    "preco": "188,20",
    "descricao": "Álgebra Linear com Aplicações, 10.ed., apresenta os fundamentos da álgebra linear. O texto foi escrito de forma que não é necessário conhecimento de Cálculo para usar e entender o conteúdo; quando esse requisito for desejável, isso está destacado (esses exercícios e exemplos podem ser omitidos sem prejuízo à continuidade do aprendizado). Também não é exigido o uso de recursos computacionais, mas para aqueles que gostam de MATLAB, Maple, Mathematica ou calculadoras com funcionalidade para álgebra linear estão incluídos exercícios no final dos capítulos que permitem um aprofundamento usando tais ferramentas. O último capítulo cobre vinte aplicações de álgebra linear das mais diversas áreas: administração, economia, física, ciência da computação, ecologia, genética e outras. As aplicações são independentes e cada uma inclui uma lista de pré-requisitos matemáticos."
  },
  {
    "id": "9788575223192",
    "isbn": "978-0074504123",
    "titulo": "Álgebra Linear",
    "slug": "algebra-linear",
    "autor": "Alfredo Steinbruch - Paulo Winterle",
    "categoria": "matematica",
    "ano": "1995",
    "paginas": "600",
    "preco": "224,00",
    "descricao": "A obra foi preparada para servir de livro-texto para um curso a ser ministrado em um semestre com uma carga horária de 4 aulas por semana. Com uma linguagem clara e acessível, o livro busca ensinar ao leitor essa disciplina fazendo uso de exercícos com respostas para a fixação da parte teórica apresentada. Esta edição, totalmente revisada, teve seus conceitos reformulados; supressões e acréscimos e, sobretudo, a inclusão de 519 problemas que o livro anterior não possuía. O texto se tornou mais prático e mais simples para atender ao objetivo maior que é o de ser útil ao processo de ensino-aprendizagem."
  },
  {
    "id": "9788575223581",
    "isbn": "978-8587918918",
    "titulo": "Geometria Analítica: Um Tratamento Vetorial",
    "slug": "geometria-analitica",
    "autor": " Paulo Boulos - Ivan De Camargo",
    "categoria": "matematica",
    "ano": "2004",
    "paginas": "560",
    "preco": "159,97",
    "descricao": "Nova edição de Geometria Analítica - Um Tratamento Vetorial confirma sua posição como um clássico das ciências exatas. Ampliado e completamente revisto pelos autores, o livro traz centenas de novos exemplos e exercícios, além de ilustrações totalmente refeitas. Possui novo layout que proporciona uma leitura mais agradável e facilita a compreensão e a localização de tópicos e exercícios, mas a estrutura didática bem-sucedida das edições anteriores foi cuidadosamente mantida. Escrita em linguagem clara e objetiva, este livro traz respostas para os exercícios e estratégias de solução, o que o torna um guia essencial para o estudo da Geometria."
  }
]
